Revit 2027 API
CurveByPointsUtils.CreateArcThroughPoints Method
 Creates an arc through the given reference points.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static CurveElement CreateArcThroughPoints(
	Document document,
	ReferencePoint startPoint,
	ReferencePoint endPoint,
	ReferencePoint interiorPoint
)
Public Shared Function CreateArcThroughPoints (
	document As Document,
	startPoint As ReferencePoint,
	endPoint As ReferencePoint,
	interiorPoint As ReferencePoint
) As CurveElement
public:
static CurveElement^ CreateArcThroughPoints(
	Document^ document,
	ReferencePoint^ startPoint,
	ReferencePoint^ endPoint,
	ReferencePoint^ interiorPoint
)
static member CreateArcThroughPoints :
        document : Document *
        startPoint : ReferencePoint *
        endPoint : ReferencePoint *
        interiorPoint : ReferencePoint -> CurveElement
Parameters
document Document
 The Document.
startPoint ReferencePoint
 The start point of the arc.
endPoint ReferencePoint
 The end end of the arc.
interiorPoint ReferencePoint
 The interior point on the arc.
Return Value
CurveElement
 The CurveElement to be created.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Can't create an arc from the given points
Remarks
 The interiorPoint determines the orientation of the arc while startPoint and endPoint determine the angle parameters at the ends.
See Also
Reference
CurveByPointsUtils Class
Autodesk.Revit.DB Namespace